import java.util.Scanner; // Импортирање на Scanner класата од пакетот java.util

public class Broevi {
    public static void main(String[] args) {
        Scanner input = new Scanner(System.in); // Креирање на објект од класата Scanner за вчитување на влез од корисникот
        
        int i, n; // Дефинирање на променливите i и n кои ќе ги користиме за итерација и за чување на горната граница
        
        System.out.print("До кој број ќе проверувате: "); // Печатење на порака за внес на горната граница на интервалот
        n = input.nextInt(); // Читање на влезот од корисникот и зачувување во променливата n
        
        i = 1; // Поставување на почетната вредност на итераторот i на 1
        
        while (i <= n) { // Почеток на while циклус кој ќе се извршува сè додека i е помало или еднакво на n
            if (i % 5 == 0) { // Проверка дали i е делливо со 5 без остаток
                System.out.println(i); // Печатење на вредноста на i доколку е делливо со 5
            }
            i = i + 1; // Зголемување на итераторот i за 1
        }
        
        input.close(); // Затварање на Scanner објектот за вчитување на влез
    }
}
